In [2]:
#Question 1
import pandas as pd
num = [1,2,3,4,5,6,7,8,9]
arr = pd.Series(num)
print(arr)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [3]:
#Question 2
num = [1,2,3,4,5,6,7,8,9]
arr = pd.Series(num)
print(f"Panda Series to List : {arr.tolist()}")
print(f"Type : {type(num)}")

Panda Series to List : [1, 2, 3, 4, 5, 6, 7, 8, 9]
Type : <class 'list'>

In [5]:
#Question 3
num1 = pd.Series([2,4,6,8,10])
num2 = pd.Series([1,3,5,7,9])
print("Addition : ")
ds = num1 + num2
print(ds)
print("Subtraction : ")
ds = num1 - num2
print(ds)
print("Multiplication : ")
ds = num1 * num2
print(ds)
print("Division : ")
ds = num1 / num2
print(ds)

Addition :
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction :
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication :
0     2
1    12
2    30
3    56
4    90
dtype: int64
Division :
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [12]:
#Question 4
num1 = pd.Series([100,200,"Python",300.12,400])
print("Original Data Series : ")
print(num1)
print("After Sorting : ")
num2 = pd.to_numeric(num1,errors = "coerce")
print(num2.sort_values(ascending = True))

Original Data Series :
0       100
1       200
2    Python
3    300.12
4       400
dtype: object
After Sorting :
0    100.00
1    200.00
3    300.12
4    400.00
2       NaN
dtype: float64

In [20]:
#Question 5
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
label = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(exam_data, index = label)
df_sort = df[(df["score"]>=15) & (df["score"]<=20)].sort_values(by="score",ascending = True)
print("Rows where score between 15 and 20 (inclusive): ")
print(df_sort)

Rows where score between 15 and 20 (inclusive):
        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes

In [24]:
#Question 6
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
label = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(exam_data, index = label)
df_sort = df[(df["score"]>=15) & (df["attempts"]<2)].sort_values(by="score",ascending = True)
print("Rows where score between 15 and 20 (inclusive): ")
print(df_sort)

Rows where score between 15 and 20 (inclusive):
    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [26]:
#Question 7
df = pd.DataFrame(exam_data, index = label)
df.loc["d","score"] = 11.5
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [28]:
#Question 8
print(f"Sum of the examination attempts by the students: {df["attempts"].sum()}")

Sum of the examination attempts by the students: 19

In [30]:
#Question 9
mean = df["score"].sum() / len(df)
print(mean)

12.0

In [41]:
#Question 10
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 
'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
label = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(exam_data, index = label)

s = {'name' : ['Suresh'], 'score': [15.5], 'attempts':[1],'qualify': ['yes']}
new = pd.DataFrame(s,index = ["k"])
add = pd.concat([df,new])
print(add)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [47]:
#Question 11
num1 = pd.DataFrame([1,2,3,4,5],columns = ['Numbers'])
num2 = pd.DataFrame([2,4,6,8,10],columns = ['Numbers'])
diff = num1[~num1['Numbers'].isin(num2['Numbers'])]
print(diff)

   Numbers
0        1
2        3
4        5

In [3]:
#Question 12
num1 = pd.DataFrame([1,2,3,4,5],columns = ['Numbers'])
num2 = pd.DataFrame([2,4,6,8,10],columns = ['Numbers'])
diff = num1[num1['Numbers'].isin(num2['Numbers'])]
print(diff)

   Numbers
1        2
3        4

In [11]:
#Question 13
df = pd.DataFrame({'school_code':['s001','s002','s003','s001','s002','s004'],
                  'class':['V','V','VI','VI','V','VI'],
                  'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
                  'date':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'], 
                  'weight': [35, 32, 33, 30, 31, 32],
                  'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'], 
                  't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
print("Default Index")
print(df.head(10))
print("\nSchool_code as Default index")
df1 = df.set_index('school_code')
print(f"{df1} \n")
print("\nt_id as Default index")
df2 = df.set_index('t_id')
print(df2)

Default Index
  school_code class            name        date  weight  address t_id
0        s001     V  Alberto Franco  15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill  17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes  16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton  25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill  11/05/2002      31  street2   t5
5        s004    VI    David Parkes  15/09/1997      32  street4   t6

School_code as Default index
            class            name        date  weight  address t_id
school_code
s001            V  Alberto Franco  15/05/2002      35  street1   t1
s002            V    Gino Mcneill  17/05/2002      32  street2   t2
s003           VI     Ryan Parkes  16/02/1999      33  street3   t3
s001           VI    Eesha Hinton  25/09/1998      30  street1   t4
s002            V    Gino Mcneill  11/05/2002      31  street2   t5
s004           VI    David Parkes  15/09/1997      32  street4   t6


t_id as Default index
     school_code class            name        date  weight  address
t_id
t1          s001     V  Alberto Franco  15/05/2002      35  street1
t2          s002     V    Gino Mcneill  17/05/2002      32  street2
t3          s003    VI     Ryan Parkes  16/02/1999      33  street3
t4          s001    VI    Eesha Hinton  25/09/1998      30  street1
t5          s002     V    Gino Mcneill  11/05/2002      31  street2
t6          s004    VI    David Parkes  15/09/1997      32  street4

In [17]:
#Question 14
df = pd.DataFrame({'school_code':['s001','s002','s003','s001','s002','s004'],
                  'class':['V','V','VI','VI','V','VI'],
                  'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
                  'date':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'], 
                  'weight': [35, 32, 33, 30, 31, 32],
                  'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'], 
                  't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
#method 1
print(" multi Index frame using two columns")
df1 = df.set_index(['school_code','t_id'])
print(df1)

#method 2
df_with_index = df.set_index(['school_code'])
df_with_index2 = df_with_index.set_index('t_id',append = True)
print("\nusing an Index and a column. : \n")
print(df_with_index2)

 multi Index frame using two columns
                 class            name        date  weight  address
school_code t_id
s001        t1       V  Alberto Franco  15/05/2002      35  street1
s002        t2       V    Gino Mcneill  17/05/2002      32  street2
s003        t3      VI     Ryan Parkes  16/02/1999      33  street3
s001        t4      VI    Eesha Hinton  25/09/1998      30  street1
s002        t5       V    Gino Mcneill  11/05/2002      31  street2
s004        t6      VI    David Parkes  15/09/1997      32  street4

using an Index and a column. :

                 class            name        date  weight  address
school_code t_id
s001        t1       V  Alberto Franco  15/05/2002      35  street1
s002        t2       V    Gino Mcneill  17/05/2002      32  street2
s003        t3      VI     Ryan Parkes  16/02/1999      33  street3
s001        t4      VI    Eesha Hinton  25/09/1998      30  street1
s002        t5       V    Gino Mcneill  11/05/2002      31  street2
s004        t6      VI    David Parkes  15/09/1997      32  street4

In [19]:
#Question 15
df = pd.DataFrame({'school_code':['s001','s002','s003','s001','s002','s004'],
                  'class':['V','V','VI','VI','V','VI'],
                  'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
                  'date':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'], 
                  'weight': [35, 32, 33, 30, 31, 32],
                  'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'], 
                  't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(f"Default Index\n  {df}")

df1 = df.set_index('t_id')
print(f"\nt_id as index :\n {df1}")

df2 = df.reset_index()
print(f"\nReset index :\n {df2}")

Default Index
    school_code class            name        date  weight  address t_id
0        s001     V  Alberto Franco  15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill  17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes  16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton  25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill  11/05/2002      31  street2   t5
5        s004    VI    David Parkes  15/09/1997      32  street4   t6

t_id as index :
      school_code class            name        date  weight  address
t_id
t1          s001     V  Alberto Franco  15/05/2002      35  street1
t2          s002     V    Gino Mcneill  17/05/2002      32  street2
t3          s003    VI     Ryan Parkes  16/02/1999      33  street3
t4          s001    VI    Eesha Hinton  25/09/1998      30  street1
t5          s002     V    Gino Mcneill  11/05/2002      31  street2
t6          s004    VI    David Parkes  15/09/1997      32  street4

Reset index :
    index school_code class            name        date  weight  address t_id
0      0        s001     V  Alberto Franco  15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill  17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes  16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton  25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill  11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes  15/09/1997      32  street4   t6

In [ ]:
#Question 16 *****

In [21]:
#Question 17
interval = pd.interval_range(start = 0,end = 50,freq = 10)
df = pd.DataFrame({'Interval': interval,
                  'value':[100,200,300,400,500]}).set_index('Interval')
print(df)

          value
Interval
(0, 10]     100
(10, 20]    200
(20, 30]    300
(30, 40]    400
(40, 50]    500